menu = """Главное меню:
    1. Выбрать книгу
    2. Создать новую книгу
    3. Изменить книгу
    4  Удалить книгу
    5. Посмотреть все записки (за дату)
    6. Открыть записку
    7. Найти записку
    8. Добавить записку
    9. Изменить записку
    10. Удалить записку
    11. Выгрузить книгу в файл
    12. Загрузить книгу из файла\n"""

input_choice = "Выберите пункт меню: "

wrong_choice = "Вы ввели неверное число. От 1 по 6"

no_note_book = "Книга не выбрана"

no_notes = "Книга пуста"

no_find_notes = "Нет найденных записок"

open_sucessfull = "Книга успешно открыта"

new_note = ["Введите название записки: ", "Введите текст: "]

no_note_books = "Книг нет"

select_book = "Выберите книгу: "

select_note = "Выберите записку: "

input_book_name = "Введите название книги: "

input_book_comment = "Введите описание книги: "

sucessfull_create_book = "Создана книга %name%"

sucessfull_delete_book = "Удалениа книга %name%"

sucessfull_delete_note = "Удалена записка %name%"

current_book = "Текущая книга: %name%"

input_note_name = "Введите название записки: "

input_note_text = "Введите текст записки: "

input_pattern = "Введите данные для поиска: "

input_file_path = "Введите путь к файлу: "

error_book_load = "Ошибка загрузки книги из файла"

input_date = "Введите дату (2022-12-31) или просто ввод тогда за весь период: "