menu = """Главное меню:
    1. Посмотреть список заметок (за дату)
    2. Открыть заметку
    3. Найти заметку
    4. Добавить заметку
    5. Изменить заметку
    6. Удалить заметку\n"""

input_choice = "Выберите пункт меню: "

wrong_choice = "Вы ввели неверное число. От 1 по 6"

no_find_notes = "Нет найденных заметок"

new_note = ["Введите заголовок заметки: ", "Введите текст: "]

select_note = "Выберите заметку: "

sucessfull_delete_note = "Удалена заметка %name%"

input_note_name = "Введите заголовок заметки: "

input_note_text = "Введите текст заметки: "

input_change_note_name = "Введите новый заголовок заметки (ввод - оставить как было): "

input_change_note_text = "Введите новый текст заметки (ввод - оставить как было): "

input_pattern = "Введите данные для поиска: "

input_file_path = "Введите путь к файлу: "

input_date = "Введите дату (2022-12-31) или просто ввод тогда за весь период: "

no_notes = "Список заметок пуст"